title: Manipulação de Shadow Copies via WMIC
id: 549d8e5a-3d21-4f10-911b-8395689146a7
status: testada
description: |
    Detecta a execução do utilitário WMIC para criar, deletar ou redimensionar Shadow Copies de volume.
    Esta técnica é amplamente utilizada por Ransomwares para impedir a recuperação de dados ou por atacantes que buscam criar snapshots do sistema para extrair arquivos sensíveis.
references:
    - https://attack.mitre.org/techniques/T1490/
    - https://attack.mitre.org/techniques/T1003/002/
author: Luiz Junior
date: 2026/04/09
tags:
    - attack.impact
    - attack.t1490
    - attack.credential-access
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\wmic.exe'
    selection_cmd:
        CommandLine|contains: 'shadowcopy'
    selection_actions:
        CommandLine|contains:
            - 'create'
            - 'delete'
            - 'resize'
    condition: selection and selection_cmd and selection_actions
falsepositives:
    - Scripts legítimos de administração de TI para manutenção de backups ou snapshots de sistema.
level: high